Revit 2027 API
IPointCloudAccess.GetExtent Method
 Implement this method to returns an object that contains the bounding box of the entire point cloud, aligned to the point cloud coordinate system.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Outline GetExtent()
Function GetExtent As Outline
Outline^ GetExtent()
abstract GetExtent : unit -> Outline
Return Value
Outline
 The bounding box of the point cloud.
Remarks
 The extents should reflect the maximum and minimum coordinates of the stored points, and not incorporate the offset.
See Also
Reference
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace